# BuiltInFailures.LevelAssociationFailures Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..LevelAssociationFailures Properties
BuiltInFailures..::..LevelAssociationFailures Class See Also
---
The BuiltInFailures..::..LevelAssociationFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllLevelsDeleted | All Levels from model were deleted |

# See Also
BuiltInFailures..::..LevelAssociationFailures Class
Autodesk.Revit.DB Namespace